In [1]:
!wget "https://raw.githubusercontent.com/opensourcemukul/AIandDeepLearning/main/Datasets/Bank_churn_modelling.csv"

--2021-02-06 11:37:05--  https://raw.githubusercontent.com/opensourcemukul/AIandDeepLearning/main/Datasets/Bank_churn_modelling.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 674857 (659K) [text/plain]
Saving to: ‘Bank_churn_modelling.csv’

Bank_churn_modellin 100%[===================>] 659.04K  --.-KB/s    in 0.07s

2021-02-06 11:37:05 (8.93 MB/s) - ‘Bank_churn_modelling.csv’ saved [674857/674857]

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df = pd.read_csv("Bank_churn_modelling.csv")

In [5]:
df

      RowNumber  CustomerId    Surname  ...  IsActiveMember EstimatedSalary Exited
0             1    15634602   Hargrave  ...               1       101348.88      1
1             2    15647311       Hill  ...               1       112542.58      0
2             3    15619304       Onio  ...               0       113931.57      1
3             4    15701354       Boni  ...               0        93826.63      0
4             5    15737888   Mitchell  ...               1        79084.10      0
...         ...         ...        ...  ...             ...             ...    ...
9995       9996    15606229   Obijiaku  ...               0        96270.64      0
9996       9997    15569892  Johnstone  ...               1       101699.77      0
9997       9998    15584532        Liu  ...               1        42085.58      1
9998       9999    15682355  Sabbatini  ...               0        92888.52      1
9999      10000    15628319     Walker  ...               0        38190.78      0

[10000 rows x 14 columns]

In [6]:
df_bkp = df

In [7]:
df = df.drop("RowNumber", axis = 1)

In [9]:
df = df.drop("CustomerId", axis = 1)
df = df.drop("Surname", axis = 1)

In [10]:
df

      CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0             619    France  Female  ...               1        101348.88       1
1             608     Spain  Female  ...               1        112542.58       0
2             502    France  Female  ...               0        113931.57       1
3             699    France  Female  ...               0         93826.63       0
4             850     Spain  Female  ...               1         79084.10       0
...           ...       ...     ...  ...             ...              ...     ...
9995          771    France    Male  ...               0         96270.64       0
9996          516    France    Male  ...               1        101699.77       0
9997          709    France  Female  ...               1         42085.58       1
9998          772   Germany    Male  ...               0         92888.52       1
9999          792    France  Female  ...               0         38190.78       0

[10000 rows x 11 columns]

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

In [13]:
df['Geography'] = df['Geography'].str.lower()
df['Gender'] = df['Gender'].str.lower()

In [14]:
df

      CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0             619    france  female  ...               1        101348.88       1
1             608     spain  female  ...               1        112542.58       0
2             502    france  female  ...               0        113931.57       1
3             699    france  female  ...               0         93826.63       0
4             850     spain  female  ...               1         79084.10       0
...           ...       ...     ...  ...             ...              ...     ...
9995          771    france    male  ...               0         96270.64       0
9996          516    france    male  ...               1        101699.77       0
9997          709    france  female  ...               1         42085.58       1
9998          772   germany    male  ...               0         92888.52       1
9999          792    france  female  ...               0         38190.78       0

[10000 rows x 11 columns]

In [15]:
df.describe()

        CreditScore           Age  ...  EstimatedSalary        Exited
count  10000.000000  10000.000000  ...     10000.000000  10000.000000
mean     650.528800     38.921800  ...    100090.239881      0.203700
std       96.653299     10.487806  ...     57510.492818      0.402769
min      350.000000     18.000000  ...        11.580000      0.000000
25%      584.000000     32.000000  ...     51002.110000      0.000000
50%      652.000000     37.000000  ...    100193.915000      0.000000
75%      718.000000     44.000000  ...    149388.247500      0.000000
max      850.000000     92.000000  ...    199992.480000      1.000000

[8 rows x 9 columns]

In [17]:
df_bkp2 = df

In [19]:
df_nocategories = df.drop("Geography", axis=1)
df_nocategories = df_nocategories.drop("Gender", axis=1)

In [20]:
df_nocategories

      CreditScore  Age  Tenure  ...  IsActiveMember  EstimatedSalary  Exited
0             619   42       2  ...               1        101348.88       1
1             608   41       1  ...               1        112542.58       0
2             502   42       8  ...               0        113931.57       1
3             699   39       1  ...               0         93826.63       0
4             850   43       2  ...               1         79084.10       0
...           ...  ...     ...  ...             ...              ...     ...
9995          771   39       5  ...               0         96270.64       0
9996          516   35      10  ...               1        101699.77       0
9997          709   36       7  ...               1         42085.58       1
9998          772   42       3  ...               0         92888.52       1
9999          792   28       4  ...               0         38190.78       0

[10000 rows x 9 columns]

In [23]:
df  = pd.get_dummies(df)

In [24]:
df

      CreditScore  Age  Tenure  ...  Geography_spain  Gender_female  Gender_male
0             619   42       2  ...                0              1            0
1             608   41       1  ...                1              1            0
2             502   42       8  ...                0              1            0
3             699   39       1  ...                0              1            0
4             850   43       2  ...                1              1            0
...           ...  ...     ...  ...              ...            ...          ...
9995          771   39       5  ...                0              0            1
9996          516   35      10  ...                0              0            1
9997          709   36       7  ...                0              1            0
9998          772   42       3  ...                0              0            1
9999          792   28       4  ...                0              1            0

[10000 rows x 14 columns]

In [25]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix

#no categories model

In [27]:
X_nc = df_nocategories.drop("Exited", axis=1)
Y_nc = df_nocategories["Exited"]

In [28]:
X_nc

      CreditScore  Age  Tenure  ...  HasCrCard  IsActiveMember  EstimatedSalary
0             619   42       2  ...          1               1        101348.88
1             608   41       1  ...          0               1        112542.58
2             502   42       8  ...          1               0        113931.57
3             699   39       1  ...          0               0         93826.63
4             850   43       2  ...          1               1         79084.10
...           ...  ...     ...  ...        ...             ...              ...
9995          771   39       5  ...          1               0         96270.64
9996          516   35      10  ...          1               1        101699.77
9997          709   36       7  ...          0               1         42085.58
9998          772   42       3  ...          1               0         92888.52
9999          792   28       4  ...          1               0         38190.78

[10000 rows x 8 columns]

In [29]:
Y_nc

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [30]:
X_train_nc, X_test_nc, Y_train_nc, Y_test_nc = train_test_split(X_nc, Y_nc, test_size=0.20, random_state=42)

In [31]:
X_train_nc

      CreditScore  Age  Tenure  ...  HasCrCard  IsActiveMember  EstimatedSalary
9254          686   32       6  ...          1               1        179093.26
1561          632   42       4  ...          1               1        195978.86
1670          559   24       3  ...          1               0         85891.02
6087          561   27       9  ...          1               0        153080.40
6669          517   56       9  ...          0               0         39488.04
...           ...  ...     ...  ...        ...             ...              ...
5734          768   54       8  ...          1               1         69381.05
5191          682   58       1  ...          1               1           706.50
5390          735   38       1  ...          0               0         92220.12
860           667   43       8  ...          1               0         97508.04
7270          697   51       1  ...          1               1         53581.14

[8000 rows x 8 columns]

In [32]:
Y_train_nc

9254    0
1561    0
1670    1
6087    1
6669    1
       ..
5734    0
5191    0
5390    1
860     1
7270    0
Name: Exited, Length: 8000, dtype: int64

In [33]:
model_nc = LogisticRegression()

In [34]:
model_nc.fit(X_train_nc,Y_train_nc)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [36]:
Y_pred_nc = model_nc.predict(X_test_nc)

In [37]:
conf_nc = confusion_matrix(Y_test_nc, Y_pred_nc)

In [38]:
conf_nc

array([[1573,   34],
       [ 365,   28]])

In [41]:
accuracy_nc = (conf_nc[0][0]+conf_nc[1][1])/(conf_nc[0][0]+conf_nc[0][1]+conf_nc[1][0]+conf_nc[1][1])

In [42]:
accuracy_nc

0.8005

In [43]:
from sklearn.metrics import accuracy_score, recall_score, precision_score, f1_score

In [44]:
accuracy_score(Y_test_nc, Y_pred_nc)

0.8005

In [45]:
recall_score(Y_test_nc, Y_pred_nc)

0.07124681933842239

In [46]:
precision_score(Y_test_nc, Y_pred_nc)

0.45161290322580644

In [47]:
f1_score(Y_test_nc, Y_pred_nc)

0.12307692307692307

# with categorical data

In [49]:
X = df.drop("Exited", axis=1)
Y = df["Exited"]

In [50]:
X

      CreditScore  Age  Tenure  ...  Geography_spain  Gender_female  Gender_male
0             619   42       2  ...                0              1            0
1             608   41       1  ...                1              1            0
2             502   42       8  ...                0              1            0
3             699   39       1  ...                0              1            0
4             850   43       2  ...                1              1            0
...           ...  ...     ...  ...              ...            ...          ...
9995          771   39       5  ...                0              0            1
9996          516   35      10  ...                0              0            1
9997          709   36       7  ...                0              1            0
9998          772   42       3  ...                0              0            1
9999          792   28       4  ...                0              1            0

[10000 rows x 13 columns]

In [51]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.20, random_state=42)

In [52]:
model = LogisticRegression()

In [53]:
model.fit(X_train,Y_train )

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [54]:
Y_pred = model.predict(X_test)

In [57]:
accuracy = accuracy_score(Y_test, Y_pred)
accuracy

0.8005

In [58]:
accuracy_score(Y_test, Y_pred)

0.8005

In [59]:
recall_score(Y_test, Y_pred)

0.07124681933842239

In [60]:
precision_score(Y_test, Y_pred)

0.45161290322580644

In [61]:
f1_score(Y_test, Y_pred)

0.12307692307692307

In [62]:
confusion_matrix(Y_test, Y_pred)

array([[1573,   34],
       [ 365,   28]])